yamanuk/SDcard_MSP432/sd.c
/****************************************
 *	sd.c								*
 ****************************************/

#include	"msp.h"
#include	"define.h"
#include	"extern.h"
#include	"sd.h"

extern	void	readSDBlock(void);
extern	void	writeSDBlock(void);
//extern	void	sdWriteMain(void);
extern	void	SDSPISel(void);
extern	void	delay1us(void);
extern	void	delay5us(void);
extern	void	delay10us(void);
extern	void	delay30us(void);
extern	void	delay100us(void);
extern	void	delay1ms(void);
extern	void	delay100ms(void);
extern	void	ledD1Off(void);
extern	void	ledD1On(void);
extern	void	ledD1OnOff(void);
extern	void	led2Off(void);
extern	void	led2On(void);
extern	void	led2OnOff(void);
extern	void	testPort1Off(void);
extern	void	testPort1On(void);
extern	void	testPort1OnOff(void);

void	sdSpeedLowSet(void);
void	sdSpeedHighSet(void);
void	sdCheck(void);
uchar	sdSetBlockLength(void);
uchar	sdReadRegister(const uchar cmd_register, const uchar length_in_bytes);
uchar	sdhcCapacity(void);
uchar	sdCapacity(void);
uchar	sdSendByte(uchar spiDataByte);
void	sendCrc(void);
void	writeOut(void);
void	writeBlock(uchar *buf);
void	readBlock(uchar *buf);
int		calc_sd_crc7(char *buf);
void	sdSendCmd(const uchar cmd, ulong data, const char crc);
uchar	sdGetResponseCMD58(void);
uchar	sdGetResponseCMD8(void);
uchar	sdGetResponseCMD(void);
uchar	sdGetResponse(void);
uchar	sdCheckBusy(void);
uchar	sdWRBusyChk(void);
uchar	sdWRStsRead(void);
//void	sdReadMain(void);
uchar	sdBlockMultiRead(long blocknum);
uchar	sdBlockRead(long blocknum);
//uchar	sdBlockRead(long blocknum, uchar *buf);
//void	sdWriteMain(void);
uchar	sdBlockMultiWrite(long blocknum, uint count,  uchar *buf);
uchar	sdBlockMultiWrite1(long blocknum, uint count);
uchar	sdBlockMultiWrite2(uint count, uchar *buf);
uchar	sdBlockMultiWrite3(void);
uchar	sdBlockWrite(long blocknum, uchar *buf);
uchar	sdInit(void);
uchar	sdInitSub(void);
void	initSd(void);

void	sdSpeedLowSet(void)
{
	SDCard.Speed = SD_LOW_SPEED;								// LowSpeed:0/HighSpeed:1
	SDSPISel();													// SPISelect
}

void	sdSpeedHighSet(void)
{
	SDCard.Speed = SD_HIGH_SPEED;								// LowSpeed:0/HighSpeed:1
	SDSPISel();													// SPISelect
}

void	sdCheck(void)
{
//SD Detect
	if(P2->IN & BIT5)
	{
		if((SDCard.DetSts == OFF) || (SDCard.DetSts == MID3))
		{
			SDCard.DetSts = MID2;
			SDCard.DetCnt = 0;
		} else if(SDCard.DetSts == MID2)
		{
			SDCard.DetCnt++;
			if(SDCard.DetCnt == 3)
			{
				SDCard.DetSts = ON;
			}
		}
	} else
	{
		if((SDCard.DetSts == ON) || (SDCard.DetSts == MID2))
		{
			SDCard.DetSts = MID3;
			SDCard.DetCnt = 0;
		} else if(SDCard.DetSts == MID3)
		{
			SDCard.DetCnt++;
			if(SDCard.DetCnt == 3)
			{
				SDCard.DetSts = OFF;
			}
		}
	}
//SD WP
#if 0
	if(P2->IN & BIT6)
	{
		if((SDCard.WPSts == OFF) || (SDCard.WPSts == MID3))
		{
			SDCard.WPSts = MID2;
			SDCard.WPCnt = 0;
		} else if(SDCard.WPSts == MID2)
		{
			SDCard.WPCnt++;
			if(SDCard.WPCnt == 3)
			{
				SDCard.WPSts = ON;
			}
		}
	} else
	{
		if((SDCard.WPSts == ON) || (SDCard.WPSts == MID2))
		{
			SDCard.WPSts = MID3;
			SDCard.WPCnt = 0;
		} else if(SDCard.WPSts == MID3)
		{
			SDCard.WPCnt++;
			if(SDCard.WPCnt == 3)
			{
				SDCard.WPSts = OFF;
			}
		}
	}
#endif
}

uchar	sdSetBlockLength(void)
{
	// Max. read data block length and Max. write data block length according to CSD Register Fields
	// is 512 bytes, i.e. one sector (512-byte sector)
	// Set the block length to read
	sdSendCmd(16, SD_BLOCK_SIZE, 0xFF);	// Send CMD16
	// get response from SD - make sure that its 0x00 (R1 ok response format)
	if(sdGetResponse()!=0x00){
		// Send 8 Clock pulses of delay.
		sdSendByte(0xFF);
		return SD_SetBL_ERROR;
	}
	// Send 8 Clock pulses of delay.
	sdSendByte(0xFF);
	return SD_SetBL_SUCCESS;
}

uchar	sdReadRegister(const uchar cmd_register, const uchar length_in_bytes)
{
	uint	uc = 0;
	uchar	rvalue = SD_RESPONSE_ERROR;
	// In SPI Mode only CID, CSD and OCR register are accessible!!! [p.g. 68]
	// Reading the contents of the OCR,CID or CSD registers in SPI mode is a simple read-block transaction.
	// The card will respond with a standard response token followed by a data block of 16 bytes,
	// suffixed with a 16-bit CRC. [p.g. 72]

	SD_NSS_Low;	// Set CS low, i.e. select card
	// Send CMD register read
	// CRC not used: 0xFF as last byte
	// Read and write commands have data transfers associated with them. Data is being
	// transmitted or received via data tokens. All data bytes are transmitted MSB first. [p.g. 80]
	sdSendCmd(cmd_register, 0x00000000, 0xFF);
	// wait for response
	// in the R1 format (0x00 is no errors)
	if (sdGetResponse() == 0x00)
	{
		if(cmd_register != 58)
		{	// If CID or CSD are read registers:
			// After R1 response, First read byte is: Start Block Token(At Single Block Read it is: 0xFE). [p.g. 80]
			if(sdGetResponse() == 0xFE)
			{
				// The next bytes are: 2-(N+1): User data. [p.g. 80]
				for (uc = 0; uc < length_in_bytes ; uc++)
				{
					sdReg_buffer[15-uc] = sdSendByte(0xFF);
				}
				// And Last two bytes are: 16-bit CRC. [p.g. 80]
				// get CRC bytes (not really needed by us, but required by SD)
				sendCrc();
				rvalue = SD_ReadREG_SUCCESS;
			} else 	rvalue = SD_RESPONSE_ERROR;
		// Error: Card hasn't sent Start Block Token.
		} else {	// If read register is OCR, i.e. CMD58
			// register read operation is: <39..31>R1, <31..0>OCR -> R3 format
			for (uc = 0; uc < length_in_bytes ; uc++)
			{
				sdReg_buffer[15-uc] = sdSendByte(0xFF);
			}
		// And Last two bytes are: 16-bit CRC. [p.g. 80]
		// get CRC bytes (not really needed by us, but required by SD)
		sendCrc();
		rvalue = SD_ReadREG_SUCCESS;
		}
	}
	else rvalue = SD_RESPONSE_ERROR;
	// Error: In card R1 response, or card hasn't sent R1 response.
	// Send 8 Clock pulses of delay.
	 sdSendByte(0xFF);
	// Send 8 Clock pulses of delay.
	sdSendByte(0xFF);
	SD_NSS_High;
	return rvalue;
}				// sd_read_register

