yamanuk/SDcard_MSP432/sd.c
uchar	sdhcCapacity(void){
	uint	C_SIZE;
	uchar	READ_BL_LEN;
	uint	BLOCK_LEN;
	ulong	BLOCKNR;
	ulong	Memory_capacity;
	
	SD_NSS_Low;	// Set CS low, i.e. select card
	//extract READ_BL_LEN from sdReg_buffer
	READ_BL_LEN = sdReg_buffer[10] & 0x0F;
	if(READ_BL_LEN > 11)	return sdMemory_Calculation_Error;
	//extract C_SIZE from sdReg_buffer
	C_SIZE = (sdReg_buffer[8] & 0xfC) << 6;
	C_SIZE = (C_SIZE | sdReg_buffer[7]) << 8;
	C_SIZE = (C_SIZE | sdReg_buffer[6]);						// Length is 22 bits, so max value is: 0x3FFFFF = 4194303
//	if(C_SIZE > 4095)	return sdMemory_Calculation_Error;

	// Insert equations from SanDisk datasheet: ProdManRS-SDv1.3 page 31
	BLOCK_LEN = 1 << READ_BL_LEN;								// Max value: 2^15 = 32767(0x7fff)
	BLOCKNR = (C_SIZE+1);										// Max value: (4194303+1) = 4194304(0x400000)
	Memory_capacity = BLOCKNR * ((ulong)BLOCK_LEN);				// Max value: 4194304*32767 = 137438953471(0x1fffffffff)
	sd_sectors = Memory_capacity;
	sdMaxSectors = Memory_capacity;
	SD_NSS_High;	// Set CS high, i.e. deselect card

	if(Memory_capacity <= 63000) 			return sdMemory_less_than_64MB;
	else if(Memory_capacity <= 65000)			return sdMemory_64MB;
	else if(Memory_capacity <= 129000)			return sdMemory_128MB;
	else if(Memory_capacity <= 257000)			return sdMemory_256MB;
	else if(Memory_capacity <= 513000)			return sdMemory_512MB;
	else if(Memory_capacity <= 1100000)			return sdMemory_1GB;
	else if(Memory_capacity <= 2100000)			return sdMemory_2GB;
	else if(Memory_capacity <= 4100000)			return sdMemory_4GB;
	else if(Memory_capacity <= 8100000)			return sdMemory_8GB;
	else if(Memory_capacity <= 17000000)		return sdMemory_16GB;
	else if(Memory_capacity <= 33000000)		return sdMemory_32GB;
	else if(Memory_capacity <= 65000000)		return sdMemory_64GB;
	else if(Memory_capacity <= 130000000)		return sdMemory_128GB;
	else 										return sdMemory_more_than_128GB;
}

uchar	sdCapacity(void){
	uint	C_SIZE;
	uchar	C_SIZE_MULT;
	uchar	READ_BL_LEN;
	uint	MULT;
	uint	BLOCK_LEN;
	ulong	BLOCKNR;
	ulong	Memory_capacity;
	uchar	Temp;
	
	SD_NSS_Low;	// Set CS low, i.e. select card
	//extract READ_BL_LEN from sdReg_buffer
	READ_BL_LEN = sdReg_buffer[10] & 0x0F;
	if(READ_BL_LEN > 11)	return sdMemory_Calculation_Error;
	//extract C_SIZE_MULT from sdReg_buffer
	C_SIZE_MULT = sdReg_buffer[6] &0x03;
	C_SIZE_MULT = C_SIZE_MULT << 1;
	if(sdReg_buffer[5] & 0x80)	C_SIZE_MULT++;
	//extract C_SIZE from sdReg_buffer
	C_SIZE = (sdReg_buffer[9] & 0x03) << 8;
	C_SIZE = (C_SIZE | sdReg_buffer[8]) << 2;
	Temp = (sdReg_buffer[7] & 0xC0) >> 6;
	C_SIZE = C_SIZE | Temp;					// Length is 12 bits, so max value is: 0xFFF = 4095
	if(C_SIZE > 4095)	return sdMemory_Calculation_Error;

	// Insert equations from SanDisk datasheet: ProdManRS-SDv1.3 page 31
	Temp = C_SIZE_MULT + 2;
	MULT = 1 << Temp;	// This is the true equation! There is an error in datasheet! MULT Max value: 512
	BLOCK_LEN = 1 << READ_BL_LEN;								// Max value: 2^11 = 2048(0x800)
	BLOCKNR = (C_SIZE+1) * ((ulong)MULT);						// Max value: (4095+1)*512 = 2097152(0x200000)
	Memory_capacity = BLOCKNR * ((ulong)BLOCK_LEN);				// Max value: 2097152*2048 = 4294967296(0x100000000)
	sd_sectors = Memory_capacity;
	sdMaxSectors = BLOCKNR;
	SD_NSS_High;	// Set CS high, i.e. deselect card

	if(Memory_capacity <= 63000000) 			return sdMemory_less_than_64MB;
	else if(Memory_capacity <= 65000000)		return sdMemory_64MB;
	else if(Memory_capacity <= 129000000)		return sdMemory_128MB;
	else if(Memory_capacity <= 257000000)		return sdMemory_256MB;
	else if(Memory_capacity <= 513000000)		return sdMemory_512MB;
	else if(Memory_capacity <= 1100000000)		return sdMemory_1GB;
	else if(Memory_capacity <= 2100000000)		return sdMemory_2GB;
	else if(Memory_capacity <= 4100000000)		return sdMemory_4GB;
	else if(Memory_capacity <= 8100000000)		return sdMemory_8GB;
	else if(Memory_capacity <= 17000000000)		return sdMemory_16GB;
	else if(Memory_capacity <= 33000000000)		return sdMemory_32GB;
	else if(Memory_capacity <= 65000000000)		return sdMemory_64GB;
	else if(Memory_capacity <= 130000000000)	return sdMemory_128GB;
	else 										return sdMemory_more_than_128GB;
}

uchar	sdSendByte(uchar spiDataByte)
{
	UCB3TXBUF = (uint)spiDataByte;
	while (!(UCB3IFG&UCRXIFG));
	spiDataByte = (uchar)UCB3RXBUF;
	return spiDataByte;
}

void	sendCrc(void)
{
	sdSendByte(0xFF);
	sdSendByte(0xFF);
}

void	readBlock(uchar *buf)
{
	uint	i;

	// clock the actual data transfer and receive the bytes;
	for (i = 0; i < SD_BLOCK_SIZE; i++)
	{
		UCB3TXBUF = (uint)0xff;
		while (!(UCB3IFG&UCRXIFG));
		buf[i] = (uchar)UCB3RXBUF;
	}
	// get CRC bytes (not really needed by us, but required by MMC)
}

void	writeOut(void)
{
	uint	i;

	for (i = 0; i < SRAM_READ_LENGTH; i++)
	{
		UCB3TXBUF = (uint)sramWorkReadBuf[i];
		while (!(UCB3IFG&UCRXIFG));
		dumData = (uchar)UCB3RXBUF;
	}
}

void	writeBlock(uchar *buf)
{
	uint	i;

	// clock the actual data transfer and receive the bytes;
	for (i = 0; i < SD_BLOCK_SIZE; i++)
	{
		UCB3TXBUF = (uint)buf[i];
		while (!(UCB3IFG&UCRXIFG));
		dumData = (uchar)UCB3RXBUF;
	}
	// get CRC bytes (not really needed by us, but required by MMC)
}

int		calc_sd_crc7(char *buf)
{
	int		crc, crc_prev;
	int		i,j;

	crc = buf[0];
	for(i = 1; i < 6; i++)
	{
		for(j = 7; j >= 0; j--)
		{
			crc <<= 1;
			crc_prev = crc;
			if (i < 5) crc |= (buf[i] >> j) & 1;
			if (crc & 0x80)
			{
				 crc ^= 0x89;
			 }
		}
	}
	return crc_prev | 1;
}

void	sdSendCmd(const uchar cmd, ulong data, const char crc)
{
	char	frame[6];
	uchar	temp;
	uint	i;

	frame[0]=(char)(cmd|0x40);
	for(i = 1; i <= 4; i++)
	{
		temp=(char)(data>>(8*(4-i)));
		frame[i]=(temp);
	}
	frame[5] = calc_sd_crc7(&frame[0]);
	for(i=0;i<6;i++) sdSendByte(frame[i]);						// Send command.
}

uchar	sdGetResponseCMD58(void)
{
	uint	i = 0;
	uint	retry = 0;
	uchar	reply = 0;
	uchar	response = ERROR;
	uchar	responsebuf[5];

	while(retry <= 64)
	{
		reply = sdSendByte(0xFF);
		if(reply == 0x01)
		{
			responsebuf[0] = reply;
			for(i = 1; i < 5; i++)
			{
				responsebuf[i] = sdSendByte(0xFF);
			}
			if((responsebuf[1] & ~0x40) != 0x00) break;
			if(responsebuf[2] != 0xFF) break;
			if(responsebuf[3] != 0x80) break;
			if(responsebuf[4] != 0x00) break;
			response = OK;
			break;
		}
		retry++;
	}
	sdSendByte(0xFF);
	if((responsebuf[1] & 0x40) != 0x00)
	{
		SDCard.Type = SDHC;
	}
	return response;
}

uchar	sdGetResponseCMD8(void)
{
	uint	i = 0;
	uint	retry = 0;
	uchar	reply = 0;
	uchar	response = ERROR;
	uchar	responsebuf[5];

	while(retry <= 64)
	{
		reply = sdSendByte(0xFF);
		if(reply == 0x05)										// SD = ILLEGAL_CMD+BUSY?
		{
			response = SDDET;
			break;
		} else if(reply == 0x01)
		{
			responsebuf[0] = reply;
			for(i = 1; i < 5; i++)
			{
				responsebuf[i] = sdSendByte(0xFF);
			}
			if(responsebuf[1] != 0x00) break;
			if(responsebuf[2] != 0x00) break;
			if(responsebuf[3] != 0x01) break;
			if(responsebuf[4] != 0xAA) break;
			response = SDHC;
			break;
		} else
		{
			responsebuf[0] = reply;
		}
		retry++;
	}
	sdSendByte(0xFF);
	return response;
}

uchar	sdGetResponseCMD(void)
{
	//Response comes 1-8bytes after command
	//the first bit will be a 0
	//followed by an error code
	//data will be 0xFF until response
	uint	retry = 0;
	uchar	response;

	while(retry <= 64)
	{
		response = sdSendByte(0xFF);
		if(response == 0x00)break;
		if(response == 0x01)break;
		if(response == 0xFE)break;
		retry++;
	}
	sdSendByte(0xFF);
	return response;
}

uchar	sdGetResponse(void)
{
	//Response comes 1-8bytes after command
	//the first bit will be a 0
	//followed by an error code
	//data will be 0xFF until response
	uint	retry = 0;
	uchar	response;

	while(retry <= 5000)
	{
		response = sdSendByte(0xFF);
		if(response == 0x00)break;
		if(response == 0x01)break;
		if(response == 0xFE)break;
		retry++;
	}
	return response;
}

