yamanuk/SDcard_MSP432/sd.c
uchar sdCheckBusy(void)
{
	uint	i = 0;
	uchar	response;
	uchar	rvalue;
	// After a data block is received, the MultiMediaCard/RS-MultiMediaCard will respond with a data-response
	// token, and if the data block is received with no errors, it will be programmed. A continuous stream of
	// busy tokens will be sent to the host (effectively holding the dataOut line low) for the duration  of
	// time the card is busy, programming. [p.g. 71]

	// Get Card Data Response Token:
	while(i <= 64)
	{
		// Waiting Data Response from card
		// Data Response Format: xxx0<status>1
		// Status = 010 óData accepted.
		// Status = 101 óData rejected due to a CRC error.
		// Status = 110 óData rejected due to a write error.
		response = sdSendByte(0xFF);
		response &= 0x1F;
		switch(response)
		{
			case 0x05: rvalue = SD_WRITE_SUCCESS;break;
			case 0x0B: return	SD_CRC_ERROR;
			case 0x0D: return	SD_WRITE_ERROR;
			default:
				rvalue = SD_OTHER_ERROR;
				break;
		}
	if(rvalue==SD_WRITE_SUCCESS)break;
	i++;
	}
	i = 0;
	// Wait until card stop sending busy token stream:
	// because a continuous stream of busy tokens will be sent to the host,
	// (effectively holding the dataOut line low) for the duration of time the card is busy, programming.
	do
	{
		response = sdSendByte(0xFF);
		i++;
		if(i == 65000)
		{
			// Error due to card doesn't stop sending of busy token stream.
			rvalue = SD_OTHER_ERROR;
			break;
		}
	}while(response==0);
	return rvalue;
}

uchar	sdWRBusyChk(void)
{
	uchar	rvalue;

	rvalue = sdSendByte(0xFF);
	return rvalue;
}

uchar	sdWRStsRead(void)
{
	uint	i = 0;
	uchar	response;
	uchar	rvalue;

	// Get Card Data Response Token:
	while(i <= 65535)
	{
		// Waiting Data Response from card
		// Data Response Format: xxx0<status>1
		// Status = 010 óData accepted.
		// Status = 101 óData rejected due to a CRC error.
		// Status = 110 óData rejected due to a write error.
		response = sdSendByte(0xFF);
		response &= 0x1F;
		switch(response)
		{
			case 0x05:
				rvalue = SD_WRITE_SUCCESS;break;
			case 0x0B:
				return	SD_CRC_ERROR;
			case 0x0D:
				return	SD_WRITE_ERROR;
			default:
				rvalue = SD_OTHER_ERROR;
				break;
		}
		if(rvalue==SD_WRITE_SUCCESS)break;
		i++;
	}
	return rvalue;
}

//******************************************************************************
// ÉuÉçÉbÉNÉäÅ[Éh
//******************************************************************************
#if 0
void	sdReadMain(void)
{
#if 0
	uchar	rep;

	rep = sdBlockMultiRead(sdCount);
	if(rep != 0)
	{
		sdErrStatus = SD_READ_ERR;
	}
//	while(readSDExe != OFF);
#else
	uchar	rep;
	uint	cnt;

	switch(readSDStatus)
	{
		case SDREADSTATUS00:
			readSDExe = ON;
			readSDCount = 0;
			readSDStatus++;
			break;
		case SDREADSTATUS01:
			rep = sdBlockRead(sdCount + readSDCount);
			if(rep != 0)
			{
				sdErrStatus = SD_READ_ERR;
			}
			readSDStatus++;
			break;
		case SDREADSTATUS02:
			if(readSDDMAStatus == SDREADDMASTATUS00)
			{
				for(cnt = 0; cnt < SD_BLOCK_SIZE; cnt++)
				{
					sdWriteBuf[SD_BLOCK_SIZE *  readSDCount+ cnt] = sdReadBuf[cnt];
				}
				readSDStatus++;
			}
			break;
		case SDREADSTATUS03:
			readSDCount++;
			if(readSDCount < SD_READ_SECTOR)
			{
				readSDStatus = SDREADSTATUS01;
			} else
			{
				readSDStatus = SDREADSTATUS00;
			}
			break;
	}

#endif
}
#endif

uchar	sdBlockMultiRead(long blocknum)
{
	uchar	rep;

	SD_NSS_Low;	// Set CS low, i.e. select card
	// send read command SD_READ_SINGLE_BLOCK=CMD17
	if(SDCard.Type == SDHC)
	{
		sdSendCmd (18,blocknum, 0xFF);
	} else
	{
		sdSendCmd (18,blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// Check if the MMC acknowledged the read block command
	// it will do this by sending an affirmative response R1 to CMD17
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		// now look for the Single Block Read (0xFE) token to signify the start of the data
		rep = sdGetResponse();
		if (rep == SD_START_DATA_BLOCK_TOKEN)
		{
//			readBlock((uchar*) buf + SD_BLOCK_SIZE * pointer);
			readSDBlock();
		} else {	// Timeout Exit
			SD_NSS_High;										// Set CS high, i.e. deselect card
			return 0xFF;
		}
	} else {
		SD_NSS_High;											// Set CS high, i.e. deselect card
		return 0xFF;
	}
	return 0;
}


#if 0
uchar	sdBlockRead(long blocknum, uchar *buf)
{
	uchar	rep;

	SD_NSS_Low;	// Set CS low, i.e. select card
	// send read command SD_READ_SINGLE_BLOCK=CMD17
	if(SDCard.Type == SDHC)
	{
		sdSendCmd (17,blocknum, 0xFF);
	} else
	{
		sdSendCmd (17,blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// Check if the MMC acknowledged the read block command
	// it will do this by sending an affirmative response R1 to CMD17
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		// now look for the Single Block Read (0xFE) token to signify the start of the data
		rep = sdGetResponse();
		if (rep == SD_START_DATA_BLOCK_TOKEN)
		{
			readBlock((uchar*) buf);
			sendCrc();
		} else {	// Timeout Exit
			SD_NSS_High;										// Set CS high, i.e. deselect card
			return 0xFF;
		}
	} else {
		SD_NSS_High;											// Set CS high, i.e. deselect card
		return 0xFF;
	}
	sdSendByte(0xFF);
	SD_NSS_High;												// Set CS high, i.e. deselect card
	return 0;
#else
uchar	sdBlockRead(long blocknum)
{
	uchar	rep;

	SD_NSS_Low;	// Set CS low, i.e. select card
	// send read command SD_READ_SINGLE_BLOCK=CMD17
	if(SDCard.Type == SDHC)
	{
		sdSendCmd (17,blocknum, 0xFF);
	} else
	{
		sdSendCmd (17,blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// Check if the MMC acknowledged the read block command
	// it will do this by sending an affirmative response R1 to CMD17
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		// now look for the Single Block Read (0xFE) token to signify the start of the data
		rep = sdGetResponse();
		if (rep == SD_START_DATA_BLOCK_TOKEN)
		{
			readBlock((uchar*) sdReadBuf);
			sdSendByte(0xFF);
			sdSendByte(0xFF);
//			readSDBlock();
		} else {	// Timeout Exit
			sdSendByte(0xFF);
			SD_NSS_High;										// Set CS high, i.e. deselect card
			sdSendByte(0xFF);
			return 0xFF;
		}
	} else {
		sdSendByte(0xFF);
		SD_NSS_High;											// Set CS high, i.e. deselect card
		sdSendByte(0xFF);
		return 0xFF;
	}
	sdSendByte(0xFF);
	SD_NSS_High;												// Set CS high, i.e. deselect card
	sdSendByte(0xFF);
	return 0;
}
#endif

