yamanuk/SDcard_MSP432/sd.c
//******************************************************************************
// ÉuÉçÉbÉNÉâÉCÉg
//******************************************************************************
void	sdBlockMultiWriteSub(void)
{
	uchar	rep;

	sdSendByte(0xFC);	// Send Start Block Token
//	writeBlock(buf);
	writeSDBlock();
	while(writeSDExe == ON);
	sendCrc();
	rep =sdWRStsRead();
	if(rep != SD_WRITE_SUCCESS)
	{
		sdErrStatus = SD_WRIT_ERR;
	}
	rep = 0;
	while(rep == 0)
	{
		rep = sdWRBusyChk();
	}
		writeSDExe = OFF;
}

uchar	sdBlockMultiWrite(long blocknum, uint count, uchar *buf)
{
	uint	CMD1_counter = 0x00;
	uint	point;
	uchar	response = 0x01;
	uchar	rep;
	SD_NSS_Low;	// Set CS low, i.e. select card

	while(response != 0x00)										// 
	{	
		sdSendCmd(55,0x00,0x65);								// 
		rep = sdGetResponseCMD();
		if (rep == ERROR)
		{
			SD_NSS_High;	// Set CS low, i.e. select card
			return 0xFF;
		}
		sdSendCmd(23, count, 0xFF);
		response = sdGetResponseCMD();
		CMD1_counter++;
		if(CMD1_counter == 10000)
		{
			SD_NSS_High;	// Set CS low, i.e. select card
			return 0xFF;
		}
	}
	// send write command
	if(SDCard.Type == SDHC)
	{
		sdSendCmd(25, blocknum, 0xFF);
	} else
	{
		sdSendCmd(25, blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// check if the MMC acknowledged the write block command
	// it will do this by sending an affirmative response R1
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		for(point = 0; point < count; point++)
		{
			memcpy(sdWriteBuf, buf, SD_BLOCK_SIZE);
			sdBlockMultiWriteSub();
			buf += SD_BLOCK_SIZE;
			if(buf >= (uchar*) (sdBuf + SD_BUFF_LENGTH))
			{
				buf -= SD_BUFF_LENGTH;
			}
		}
		sdSendByte(0xFD);
		rep = sdGetResponse();
		if(rep != 0x00)
		{
			sdErrStatus = SD_WRIT_ERR;
		}
		SD_NSS_High;												// Set CS high, i.e. deselect card
		sdSendByte(0xFF);
	} else {
		// the MMC never acknowledge the write command
		SD_NSS_High;	// Set CS low, i.e. select card
		sdSendByte(0xFF);
		return 0xFF;
	}
	SD_NSS_High;	// Set CS low, i.e. select card
	SD_NSS_Low;												// Set CS low, i.e. select card
	while(rep == 0)
	{
		rep = sdWRBusyChk();
	}
	SD_NSS_High;											// Set CS high, i.e. deselect card
	sdSendByte(0xFF);
	return 0;
}

uchar	sdBlockMultiWrite1(long blocknum, uint count)
{
	uint	CMD1_counter = 0x00;
//	uint	point;
	uchar	response = 0x01;
	uchar	rep;
	SD_NSS_Low;	// Set CS low, i.e. select card

	while(response != 0x00)										// 
	{	
		sdSendCmd(55,0x00,0x65);								// 
		rep = sdGetResponseCMD();
		if (rep == ERROR)
		{
			SD_NSS_High;	// Set CS low, i.e. select card
			return 0xFF;
		}
		sdSendCmd(23, count, 0xFF);
		response = sdGetResponseCMD();
		CMD1_counter++;
		if(CMD1_counter == 10000)
		{
			SD_NSS_High;	// Set CS low, i.e. select card
			return 0xFF;
		}
	}
	// send write command
	if(SDCard.Type == SDHC)
	{
		sdSendCmd(25, blocknum, 0xFF);
	} else
	{
		sdSendCmd(25, blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// check if the MMC acknowledged the write block command
	// it will do this by sending an affirmative response R1
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		SD_NSS_Low;	// Set CS low, i.e. select card
		return 0;
	} else {
		// the MMC never acknowledge the write command
		SD_NSS_High;	// Set CS low, i.e. select card
		sdSendByte(0xFF);
		return 0xFF;
	}
}

uchar	sdBlockMultiWrite2(uint count, uchar *buf)
{
	uint	point;

ledD1On();
	for(point = 0; point < count; point++)
	{
		memcpy(sdWriteBuf, buf, SD_BLOCK_SIZE);
		sdBlockMultiWriteSub();
		buf += SD_BLOCK_SIZE;
		if(buf >= (uchar*) (sdBuf + SD_BUFF_LENGTH))
		{
			buf -= SD_BUFF_LENGTH;
		}
	}
ledD1Off();
	return 0;
}

uchar	sdBlockMultiWrite3(void)
{
	uchar	rep;

	sdSendByte(0xFD);
	rep = sdGetResponse();
	if(rep != 0x00)
	{
		sdErrStatus = SD_WRIT_ERR;
	}
	SD_NSS_High;											// Set CS high, i.e. deselect card
	sdSendByte(0xFF);
	SD_NSS_High;	// Set CS low, i.e. select card

	SD_NSS_Low;	// Set CS low, i.e. select card

	while(rep == 0)
	{
		rep = sdWRBusyChk();
	}
	SD_NSS_High;											// Set CS high, i.e. deselect card
	sdSendByte(0xFF);
	return 0;
}

uchar	sdBlockWrite(long blocknum, uchar *buf)
{
	uchar	rep;

	// send write command
	if(SDCard.Type == SDHC)
	{
		sdSendCmd (24,blocknum, 0xFF);
	} else
	{
		sdSendCmd (24,blocknum * SD_BLOCK_SIZE, 0xFF);
	}
	// check if the MMC acknowledged the write block command
	// it will do this by sending an affirmative response R1
	// in the R1 format (0x00 is no errors)
	rep = sdGetResponse();
	if (rep == 0x00)
	{
		// send the data token to signify the start of the data
		sdSendByte(0xFE);	// Send Start Block Token
		// clock the actual data transfer and transmit the bytes
		writeBlock((uchar*)buf);
//		writeSDBlock();
		sendCrc();
		rep = sdCheckBusy();
		if(rep != SD_WRITE_SUCCESS)
		{
			return 0xFF;
		}
	} else {
		// the MMC never acknowledge the write command
		return 0xFF;
	}
	SD_NSS_High;												// Set CS high, i.e. deselect card
	return 0;
}

uchar	sdInitSub(void)
{
	uint	i;
	uchar	sd_size;
	ulong	OCR_value = 0x00000000;
	uchar	reply = 0;

	// 4. Read OCR register!!!
	reply = sdReadRegister(58,4);								// OCR Register read
	if(reply == SD_ReadREG_SUCCESS)
	{
		for(i = 0; i <= 3; i++)
		{
			OCR_value = OCR_value | sdReg_buffer[15-i];
			if(i==3)	break;
			OCR_value = OCR_value << 8;
		}
		if(sdReg_buffer[15]&0x80)								//
		{
			if((OCR_value == 0x80FF8000) || (OCR_value == 0x80007F00) || (OCR_value == 0x80000080))
			{
				if(SDCard.Type != SDV1)
				{
					SDCard.Type = SDV2;
				}
			}
			else if((OCR_value == 0xC0FF8000) || (OCR_value == 0xC0007F00) || (OCR_value == 0xC0000080))
			{
				SDCard.Type = SDHC;
			}
			else
			{
				return	SD_INIT_NG;
			}
		} else
		{
			return	SD_INIT_NG;
		}
	} else														// Error in OCR register reading
	{
		return	SD_INIT_NG;
	}
	// 5. Read CID Register
	reply = sdReadRegister(10,16);								// CID Register read
	if(!(reply == SD_ReadREG_SUCCESS))
	{
		return	SD_INIT_NG;
	}
	//6. Read CSD Register and calculate card size
	reply = sdReadRegister(9,16);								// CSD Register read
	if(reply== SD_ReadREG_SUCCESS)
	{
		if(SDCard.Type == SDHC)
		{
			sd_size = sdhcCapacity();
		} else
		{
			sd_size = sdCapacity();
		}
		if ((sd_size < sdMemory_less_than_64MB) || (sd_size > sdMemory_more_than_128GB))
		{
			return	SD_INIT_NG;
		}
	} else														// Error in CSD register reading
	{
		return	SD_INIT_NG;
	}
	SD_NSS_Low;	// Set CS low, i.e. select card
	reply = sdSetBlockLength();									// block length could be set
	if (reply == SD_SetBL_SUCCESS)
	{
		SD_NSS_High;
		return	SD_INIT_OK;
	} else
	{
		SD_NSS_High;
		return	SD_INIT_NG;
	}
}

