yamanuk/SDcard_MSP432/sd.c
uchar	sdInit(void)
{
	uint	i;
	uint	CMD1_counter = 0x00;
	uchar	response = 0x01;
	uchar	reply = 0;

	SD_NSS_High;
	delay100us();
	for(i = 0; i < 10; i++)
	{
		sdSendByte(0xff);
	}
	delay100us();
	SD_NSS_Low;
	sdSendCmd(0,0,0x95);
	reply = sdGetResponseCMD();									// 
	if(reply == 0xFF)	return SD_INIT_FAIL;					// Response error
	sdSendCmd(8,0x000001AA,0x87);								// 
	reply = sdGetResponseCMD8();
	if(reply == ERROR)
	{
		return 2;												// Response error
	}
	if(reply == SDDET)	goto SD_CARD;							// Response
	//SDHC_CARD
	sdSendCmd(58,0,0xFD);										// 
	reply = sdGetResponseCMD58();
	if(reply == ERROR)	return 3;								// Response error
	while(response != 0x00)										// 
	{	
		sdSendCmd(55,0x00,0x65);								// 
		reply = sdGetResponseCMD();								// 
		if(reply == ERROR)	return 4;							// Response error
		sdSendCmd(41,0x40FF8000,0xE5);							// 
		response = sdGetResponseCMD();							// 
		CMD1_counter++;
		if(CMD1_counter == 10000)
		{
			return 5;
		}
	}
	delay100us();
	SD_NSS_High;
	sdSendByte(0xFF);											// 
	if(SDCard.Type != SDHC)
	{
		SDCard.Type = SDV2;
	}
	return SD_INIT_SUCCESS;

SD_CARD:
	while(response != 0x00)										// 
	{	
		sdSendCmd(0x01,0x00,0xFF);								// 
		response = sdGetResponse();								// 
		CMD1_counter++;
		if(CMD1_counter == 1000)	return 6;
	}
	delay100us();
	SD_NSS_High;
	sdSendByte(0xFF);											// 
	SDCard.Type = SDV1;
	return SD_INIT_SUCCESS;
}

void	initSd(void)
{
	uchar	reply;

	sdSpeedLowSet();											// SD Card Low Speed

	reply = sdInit();
	if(reply == SD_INIT_SUCCESS)
	{
		reply = sdInitSub();
		if(reply == SD_INIT_SUCCESS)
		{
			sdSpeedHighSet();									// SD Card High Speed
		} else
		{
			SDCard.Err_Flag = NG;
		}
	} else
	{
		SDCard.Err_Flag = NG;
	}
}


